## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_registry.aks-acr_acr will be created
  + resource "azurerm_container_registry" "aks-acr_acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "northeurope"
      + login_server                  = (known after apply)
      + name                          = "aksclusternortheuropeacr"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "akscluster-northeurope-acr-rg"
      + sku                           = "Basic"
      + tags                          = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = false
    }

  # azurerm_dashboard_grafana.aks_grafana will be created
  + resource "azurerm_dashboard_grafana" "aks_grafana" {
      + api_key_enabled                        = false
      + auto_generated_domain_name_label_scope = "TenantReuse"
      + deterministic_outbound_ip_enabled      = false
      + endpoint                               = (known after apply)
      + grafana_major_version                  = "10"
      + grafana_version                        = (known after apply)
      + id                                     = (known after apply)
      + location                               = "northeurope"
      + name                                   = "miszelegrafana"
      + outbound_ip                            = (known after apply)
      + public_network_access_enabled          = true
      + resource_group_name                    = "akscluster-northeurope-monitoring-rg"
      + sku                                    = "Standard"
      + tags                                   = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }
      + zone_redundancy_enabled                = false

      + azure_monitor_workspace_integrations {
          + resource_id = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_kubernetes_cluster.aks_cluster will be created
  + resource "azurerm_kubernetes_cluster" "aks_cluster" {
      + automatic_upgrade_channel           = "patch"
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "akscluster-dns"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = true
      + image_cleaner_interval_hours        = 168
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + local_account_disabled              = true
      + location                            = "northeurope"
      + name                                = "akscluster"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = "akscluster-northeurope-node-rg"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "akscluster-northeurope-aks-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }
      + workload_identity_enabled           = false

      + auto_scaler_profile (known after apply)

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = [
              + "44355144-d87d-4e26-818c-0fd9babacf9a",
            ]
          + azure_rbac_enabled     = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + auto_scaling_enabled        = true
          + kubelet_disk_type           = (known after apply)
          + max_count                   = 3
          + max_pods                    = 110
          + min_count                   = 2
          + name                        = "agent"
          + node_count                  = 2
          + node_labels                 = (known after apply)
          + orchestrator_version        = (known after apply)
          + os_disk_size_gb             = (known after apply)
          + os_disk_type                = "Managed"
          + os_sku                      = (known after apply)
          + scale_down_mode             = "Delete"
          + temporary_name_for_rotation = "agenttemp"
          + type                        = "VirtualMachineScaleSets"
          + ultra_ssd_enabled           = false
          + vm_size                     = "Standard_D2s_v3"
          + vnet_subnet_id              = (known after apply)
          + workload_runtime            = (known after apply)
          + zones                       = [
              + "1",
              + "2",
              + "3",
            ]

          + upgrade_settings {
              + drain_timeout_in_minutes      = 0
              + max_surge                     = "10%"
              + node_soak_duration_in_minutes = 0
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "10m"
        }

      + kubelet_identity (known after apply)

      + maintenance_window_auto_upgrade {
          + day_of_week = "Sunday"
          + duration    = 4
          + frequency   = "Weekly"
          + interval    = 1
          + start_date  = "2024-10-22T00:00:00Z"
          + start_time  = "00:00"
          + utc_offset  = "+00:00"
        }

      + maintenance_window_node_os {
          + day_of_week = "Sunday"
          + duration    = 4
          + frequency   = "Weekly"
          + interval    = 1
          + start_date  = "2024-10-22T00:00:00Z"
          + start_time  = "00:00"
          + utc_offset  = "+00:00"
        }

      + monitor_metrics {}

      + network_profile {
          + dns_service_ip      = (known after apply)
          + ip_versions         = (known after apply)
          + load_balancer_sku   = "standard"
          + network_data_plane  = "cilium"
          + network_mode        = (known after apply)
          + network_plugin      = "azure"
          + network_plugin_mode = "overlay"
          + network_policy      = "cilium"
          + outbound_type       = "loadBalancer"
          + pod_cidr            = (known after apply)
          + pod_cidrs           = (known after apply)
          + service_cidr        = (known after apply)
          + service_cidrs       = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + oms_agent {
          + log_analytics_workspace_id      = (known after apply)
          + msi_auth_for_monitoring_enabled = true
          + oms_agent_identity              = (known after apply)
        }

      + windows_profile (known after apply)
    }

  # azurerm_kubernetes_cluster_node_pool.aks_cluster_userpool["user"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "aks_cluster_userpool" {
      + auto_scaling_enabled  = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 2
      + max_pods              = 110
      + min_count             = 1
      + mode                  = "User"
      + name                  = "user"
      + node_count            = 1
      + node_labels           = (known after apply)
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D2s_v3"
      + vnet_subnet_id        = (known after apply)
      + zones                 = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # azurerm_log_analytics_workspace.aks_laws will be created
  + resource "azurerm_log_analytics_workspace" "aks_laws" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "northeurope"
      + name                            = "aksmonitoring"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "akscluster-northeurope-monitoring-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_monitor_alert_prometheus_rule_group.kubernetes_recording_rules_rule_group will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "kubernetes_recording_rules_rule_group" {
      + cluster_name        = "akscluster"
      + description         = "Kubernetes Recording Rules Rule Group"
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "northeurope"
      + name                = "KubernetesRecordingRulesRuleGroup-akscluster"
      + resource_group_name = "akscluster-northeurope-monitoring-rg"
      + rule_group_enabled  = true
      + scopes              = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }

      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (cluster, namespace, pod, container) (  irate(container_cpu_usage_seconds_total{job="cadvisor", image!=""}[5m])) * on (cluster, namespace, pod) group_left(node) topk by (cluster, namespace, pod) (  1, max by(cluster, namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_cpu_usage_seconds_total:sum_irate"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_working_set_bytes{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_working_set_bytes"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_rss{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_rss"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_cache{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_cache"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_swap{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_swap"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_requests"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_memory:kube_pod_container_resource_requests:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_requests"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_cpu:kube_pod_container_resource_requests:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_limits"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_memory:kube_pod_container_resource_limits:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) ( (kube_pod_status_phase{phase=~"Pending|Running"} == 1) )
            EOT
          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_limits"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_cpu:kube_pod_container_resource_limits:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    label_replace(      kube_pod_owner{job="kube-state-metrics", owner_kind="ReplicaSet"},      "replicaset", "$1", "owner_name", "(.*)"    ) * on(replicaset, namespace) group_left(owner_name) topk by(replicaset, namespace) (      1, max by (replicaset, namespace, owner_name) (        kube_replicaset_owner{job="kube-state-metrics"}      )    ),    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "deployment"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="DaemonSet"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "daemonset"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="StatefulSet"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "statefulset"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="Job"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "job"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(  node_memory_MemAvailable_bytes{job="node"} or  (    node_memory_Buffers_bytes{job="node"} +    node_memory_Cached_bytes{job="node"} +    node_memory_MemFree_bytes{job="node"} +    node_memory_Slab_bytes{job="node"}  )) by (cluster)
            EOT
          + record     = ":node_memory_MemAvailable_bytes:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(rate(node_cpu_seconds_total{job="node",mode!="idle",mode!="iowait",mode!="steal"}[5m])) by (cluster) /count(sum(node_cpu_seconds_total{job="node"}) by (cluster, instance, cpu)) by (cluster)
            EOT
          + record     = "cluster:node_cpu:ratio_rate5m"
        }
    }

  # azurerm_monitor_alert_prometheus_rule_group.node_and_kubernetes_recording_rules_rule_group_win will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "node_and_kubernetes_recording_rules_rule_group_win" {
      + cluster_name        = "akscluster"
      + description         = "Node and Kubernetes Recording Rules Rule Group for Windows Nodes"
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "northeurope"
      + name                = "NodeAndKubernetesRecordingRulesRuleGroup-Win-akscluster"
      + resource_group_name = "akscluster-northeurope-monitoring-rg"
      + rule_group_enabled  = true
      + scopes              = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }

      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (instance,volume)((windows_logical_disk_size_bytes{job="windows-exporter"} - windows_logical_disk_free_bytes{job="windows-exporter"}) / windows_logical_disk_size_bytes{job="windows-exporter"})
            EOT
          + record     = "node:windows_node_filesystem_usage:"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (instance, volume) (windows_logical_disk_free_bytes{job="windows-exporter"} / windows_logical_disk_size_bytes{job="windows-exporter"})
            EOT
          + record     = "node:windows_node_filesystem_avail:"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(irate(windows_net_bytes_total{job="windows-exporter"}[5m]))
            EOT
          + record     = ":windows_node_net_utilisation:sum_irate"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (instance) ((irate(windows_net_bytes_total{job="windows-exporter"}[5m])))
            EOT
          + record     = "node:windows_node_net_utilisation:sum_irate"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(irate(windows_net_packets_received_discarded_total{job="windows-exporter"}[5m])) + sum(irate(windows_net_packets_outbound_discarded_total{job="windows-exporter"}[5m]))
            EOT
          + record     = ":windows_node_net_saturation:sum_irate"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (instance) ((irate(windows_net_packets_received_discarded_total{job="windows-exporter"}[5m]) + irate(windows_net_packets_outbound_discarded_total{job="windows-exporter"}[5m])))
            EOT
          + record     = "node:windows_node_net_saturation:sum_irate"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                windows_container_available{job="windows-exporter", container_id != ""} * on(container_id) group_left(container, pod, namespace) max(kube_pod_container_info{job="kube-state-metrics", container_id != ""}) by(container, container_id, pod, namespace)
            EOT
          + record     = "windows_pod_container_available"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                windows_container_cpu_usage_seconds_total{job="windows-exporter", container_id != ""} * on(container_id) group_left(container, pod, namespace) max(kube_pod_container_info{job="kube-state-metrics", container_id != ""}) by(container, container_id, pod, namespace)
            EOT
          + record     = "windows_container_total_runtime"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                windows_container_memory_usage_commit_bytes{job="windows-exporter", container_id != ""} * on(container_id) group_left(container, pod, namespace) max(kube_pod_container_info{job="kube-state-metrics", container_id != ""}) by(container, container_id, pod, namespace)
            EOT
          + record     = "windows_container_memory_usage"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                windows_container_memory_usage_private_working_set_bytes{job="windows-exporter", container_id != ""} * on(container_id) group_left(container, pod, namespace) max(kube_pod_container_info{job="kube-state-metrics", container_id != ""}) by(container, container_id, pod, namespace)
            EOT
          + record     = "windows_container_private_working_set_usage"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                windows_container_network_receive_bytes_total{job="windows-exporter", container_id != ""} * on(container_id) group_left(container, pod, namespace) max(kube_pod_container_info{job="kube-state-metrics", container_id != ""}) by(container, container_id, pod, namespace)
            EOT
          + record     = "windows_container_network_received_bytes_total"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                windows_container_network_transmit_bytes_total{job="windows-exporter", container_id != ""} * on(container_id) group_left(container, pod, namespace) max(kube_pod_container_info{job="kube-state-metrics", container_id != ""}) by(container, container_id, pod, namespace)
            EOT
          + record     = "windows_container_network_transmitted_bytes_total"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (namespace, pod, container) (kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}) * on(container,pod,namespace) (windows_pod_container_available)
            EOT
          + record     = "kube_pod_windows_container_resource_memory_request"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"} * on(container,pod,namespace) (windows_pod_container_available)
            EOT
          + record     = "kube_pod_windows_container_resource_memory_limit"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (namespace, pod, container) ( kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}) * on(container,pod,namespace) (windows_pod_container_available)
            EOT
          + record     = "kube_pod_windows_container_resource_cpu_cores_request"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"} * on(container,pod,namespace) (windows_pod_container_available)
            EOT
          + record     = "kube_pod_windows_container_resource_cpu_cores_limit"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, pod, container) (rate(windows_container_total_runtime{}[5m]))
            EOT
          + record     = "namespace_pod_container:windows_container_cpu_usage_seconds_total:sum_rate"
        }
    }

  # azurerm_monitor_alert_prometheus_rule_group.node_recording_rules_rule_group will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "node_recording_rules_rule_group" {
      + cluster_name        = "akscluster"
      + description         = "Node Recording Rules Rule Group"
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "northeurope"
      + name                = "NodeRecordingRulesRuleGroup-akscluster"
      + resource_group_name = "akscluster-northeurope-monitoring-rg"
      + rule_group_enabled  = true
      + scopes              = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }

      + rule {
          + enabled    = true
          + expression = <<-EOT
                count without (cpu, mode) (  node_cpu_seconds_total{job="node",mode="idle"})
            EOT
          + record     = "instance:node_num_cpu:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 - avg without (cpu) (  sum without (mode) (rate(node_cpu_seconds_total{job="node", mode=~"idle|iowait|steal"}[5m])))
            EOT
          + record     = "instance:node_cpu_utilisation:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                (  node_load1{job="node"}/  instance:node_num_cpu:sum{job="node"})
            EOT
          + record     = "instance:node_load1_per_cpu:ratio"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 - (  (    node_memory_MemAvailable_bytes{job="node"}    or    (      node_memory_Buffers_bytes{job="node"}      +      node_memory_Cached_bytes{job="node"}      +      node_memory_MemFree_bytes{job="node"}      +      node_memory_Slab_bytes{job="node"}    )  )/  node_memory_MemTotal_bytes{job="node"})
            EOT
          + record     = "instance:node_memory_utilisation:ratio"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_vmstat_pgmajfault{job="node"}[5m])
            EOT
          + record     = "instance:node_vmstat_pgmajfault:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_disk_io_time_seconds_total{job="node", device!=""}[5m])
            EOT
          + record     = "instance_device:node_disk_io_time_seconds:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_disk_io_time_weighted_seconds_total{job="node", device!=""}[5m])
            EOT
          + record     = "instance_device:node_disk_io_time_weighted_seconds:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_receive_bytes_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_receive_bytes_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_transmit_bytes_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_transmit_bytes_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_receive_drop_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_receive_drop_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_transmit_drop_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_transmit_drop_excluding_lo:rate5m"
        }
    }

  # azurerm_monitor_alert_prometheus_rule_group.node_recording_rules_rule_group_win will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "node_recording_rules_rule_group_win" {
      + cluster_name        = "akscluster"
      + description         = "Node and Kubernetes Recording Rules Rule Group for Windows Nodes"
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "northeurope"
      + name                = "NodeRecordingRulesRuleGroup-Win-akscluster"
      + resource_group_name = "akscluster-northeurope-monitoring-rg"
      + rule_group_enabled  = true
      + scopes              = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }

      + rule {
          + enabled    = true
          + expression = <<-EOT
                count (windows_system_system_up_time{job="windows-exporter"})
            EOT
          + record     = "node:windows_node:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                count by (instance) (sum by (instance, core) (windows_cpu_time_total{job="windows-exporter"}))
            EOT
          + record     = "node:windows_node_num_cpu:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 - avg(rate(windows_cpu_time_total{job="windows-exporter",mode="idle"}[5m]))
            EOT
          + record     = ":windows_node_cpu_utilisation:avg5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 - avg by (instance) (rate(windows_cpu_time_total{job="windows-exporter",mode="idle"}[5m]))
            EOT
          + record     = "node:windows_node_cpu_utilisation:avg5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 -sum(windows_memory_available_bytes{job="windows-exporter"})/sum(windows_os_visible_memory_bytes{job="windows-exporter"})
            EOT
          + record     = ":windows_node_memory_utilisation:"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(windows_memory_available_bytes{job="windows-exporter"} + windows_memory_cache_bytes{job="windows-exporter"})
            EOT
          + record     = ":windows_node_memory_MemFreeCached_bytes:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                (windows_memory_cache_bytes{job="windows-exporter"} + windows_memory_modified_page_list_bytes{job="windows-exporter"} + windows_memory_standby_cache_core_bytes{job="windows-exporter"} + windows_memory_standby_cache_normal_priority_bytes{job="windows-exporter"} + windows_memory_standby_cache_reserve_bytes{job="windows-exporter"})
            EOT
          + record     = "node:windows_node_memory_totalCached_bytes:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(windows_os_visible_memory_bytes{job="windows-exporter"})
            EOT
          + record     = ":windows_node_memory_MemTotal_bytes:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (instance) ((windows_memory_available_bytes{job="windows-exporter"}))
            EOT
          + record     = "node:windows_node_memory_bytes_available:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (instance) (windows_os_visible_memory_bytes{job="windows-exporter"})
            EOT
          + record     = "node:windows_node_memory_bytes_total:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                (node:windows_node_memory_bytes_total:sum - node:windows_node_memory_bytes_available:sum) / scalar(sum(node:windows_node_memory_bytes_total:sum))
            EOT
          + record     = "node:windows_node_memory_utilisation:ratio"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 - (node:windows_node_memory_bytes_available:sum / node:windows_node_memory_bytes_total:sum)
            EOT
          + record     = "node:windows_node_memory_utilisation:"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                irate(windows_memory_swap_page_operations_total{job="windows-exporter"}[5m])
            EOT
          + record     = "node:windows_node_memory_swap_io_pages:irate"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                avg(irate(windows_logical_disk_read_seconds_total{job="windows-exporter"}[5m]) + irate(windows_logical_disk_write_seconds_total{job="windows-exporter"}[5m]))
            EOT
          + record     = ":windows_node_disk_utilisation:avg_irate"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                avg by (instance) ((irate(windows_logical_disk_read_seconds_total{job="windows-exporter"}[5m]) + irate(windows_logical_disk_write_seconds_total{job="windows-exporter"}[5m])))
            EOT
          + record     = "node:windows_node_disk_utilisation:avg_irate"
        }
    }

  # azurerm_monitor_data_collection_endpoint.aks_dce will be created
  + resource "azurerm_monitor_data_collection_endpoint" "aks_dce" {
      + configuration_access_endpoint = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + kind                          = "Linux"
      + location                      = "northeurope"
      + logs_ingestion_endpoint       = (known after apply)
      + name                          = "aksdce"
      + public_network_access_enabled = true
      + resource_group_name           = "akscluster-northeurope-monitoring-rg"
    }

  # azurerm_monitor_data_collection_rule.aks_cidcr will be created
  + resource "azurerm_monitor_data_collection_rule" "aks_cidcr" {
      + id                  = (known after apply)
      + immutable_id        = (known after apply)
      + location            = "northeurope"
      + name                = "MSCI-northeurope-akscluster"
      + resource_group_name = "akscluster-northeurope-monitoring-rg"
      + tags                = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }

      + data_flow {
          + destinations = [
              + "ciworkspace",
            ]
          + streams      = [
              + "Microsoft-ContainerLog",
              + "Microsoft-ContainerLogV2",
              + "Microsoft-KubeEvents",
              + "Microsoft-KubePodInventory",
              + "Microsoft-KubeNodeInventory",
              + "Microsoft-KubePVInventory",
              + "Microsoft-KubeServices",
              + "Microsoft-KubeMonAgentEvents",
              + "Microsoft-InsightsMetrics",
              + "Microsoft-ContainerInventory",
              + "Microsoft-ContainerNodeInventory",
              + "Microsoft-Perf",
            ]
        }
      + data_flow {
          + destinations = [
              + "ciworkspace",
            ]
          + streams      = [
              + "Microsoft-Syslog",
            ]
        }

      + data_sources {
          + extension {
              + extension_json = jsonencode(
                    {
                      + dataCollectionSettings = {
                          + enableContainerLogV2   = true
                          + interval               = "1m"
                          + namespaceFilteringMode = "Off"
                          + namespaces             = [
                              + "kube-system",
                              + "gatekeeper-system",
                              + "azure-arc",
                            ]
                        }
                    }
                )
              + extension_name = "ContainerInsights"
              + name           = "ContainerInsightsExtension"
              + streams        = [
                  + "Microsoft-ContainerLog",
                  + "Microsoft-ContainerLogV2",
                  + "Microsoft-KubeEvents",
                  + "Microsoft-KubePodInventory",
                  + "Microsoft-KubeNodeInventory",
                  + "Microsoft-KubePVInventory",
                  + "Microsoft-KubeServices",
                  + "Microsoft-KubeMonAgentEvents",
                  + "Microsoft-InsightsMetrics",
                  + "Microsoft-ContainerInventory",
                  + "Microsoft-ContainerNodeInventory",
                  + "Microsoft-Perf",
                ]
            }
          + syslog {
              + facility_names = [
                  + "auth",
                  + "authpriv",
                  + "cron",
                  + "daemon",
                  + "mark",
                  + "kern",
                  + "local0",
                  + "local1",
                  + "local2",
                  + "local3",
                  + "local4",
                  + "local5",
                  + "local6",
                  + "local7",
                  + "lpr",
                  + "mail",
                  + "news",
                  + "syslog",
                  + "user",
                  + "uucp",
                ]
              + log_levels     = [
                  + "Debug",
                  + "Info",
                  + "Notice",
                  + "Warning",
                  + "Error",
                  + "Critical",
                  + "Alert",
                  + "Emergency",
                ]
              + name           = "sysLogsDataSource"
              + streams        = [
                  + "Microsoft-Syslog",
                ]
            }
        }

      + destinations {
          + log_analytics {
              + name                  = "ciworkspace"
              + workspace_resource_id = (known after apply)
            }
        }
    }

  # azurerm_monitor_data_collection_rule.aks_promdcr will be created
  + resource "azurerm_monitor_data_collection_rule" "aks_promdcr" {
      + data_collection_endpoint_id = (known after apply)
      + id                          = (known after apply)
      + immutable_id                = (known after apply)
      + location                    = "northeurope"
      + name                        = "MSProm-northeurope-akscluster"
      + resource_group_name         = "akscluster-northeurope-monitoring-rg"
      + tags                        = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }

      + data_flow {
          + destinations = [
              + "MonitoringAccount1",
            ]
          + streams      = [
              + "Microsoft-PrometheusMetrics",
            ]
        }

      + data_sources {
          + prometheus_forwarder {
              + name    = "PrometheusDataSource"
              + streams = [
                  + "Microsoft-PrometheusMetrics",
                ]
            }
        }

      + destinations {
          + monitor_account {
              + monitor_account_id = (known after apply)
              + name               = "MonitoringAccount1"
            }
        }
    }

  # azurerm_monitor_data_collection_rule_association.aks_amwdcra will be created
  + resource "azurerm_monitor_data_collection_rule_association" "aks_amwdcra" {
      + data_collection_rule_id = (known after apply)
      + id                      = (known after apply)
      + name                    = "MSProm-northeurope-akscluster"
      + target_resource_id      = (known after apply)
    }

  # azurerm_monitor_data_collection_rule_association.aks_cidcra will be created
  + resource "azurerm_monitor_data_collection_rule_association" "aks_cidcra" {
      + data_collection_rule_id = (known after apply)
      + id                      = (known after apply)
      + name                    = "ContainerInsightsExtension"
      + target_resource_id      = (known after apply)
    }

  # azurerm_monitor_workspace.aks_amw will be created
  + resource "azurerm_monitor_workspace" "aks_amw" {
      + default_data_collection_endpoint_id = (known after apply)
      + default_data_collection_rule_id     = (known after apply)
      + id                                  = (known after apply)
      + location                            = "northeurope"
      + name                                = "aksamw"
      + public_network_access_enabled       = true
      + query_endpoint                      = (known after apply)
      + resource_group_name                 = "akscluster-northeurope-monitoring-rg"
      + tags                                = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }
    }

  # azurerm_resource_group.aks-acr_rg will be created
  + resource "azurerm_resource_group" "aks-acr_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "akscluster-northeurope-acr-rg"
      + tags     = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }
    }

  # azurerm_resource_group.aks-monitoring_rg will be created
  + resource "azurerm_resource_group" "aks-monitoring_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "akscluster-northeurope-monitoring-rg"
      + tags     = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }
    }

  # azurerm_resource_group.aks-network_rg will be created
  + resource "azurerm_resource_group" "aks-network_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "akscluster-northeurope-network-rg"
      + tags     = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }
    }

  # azurerm_resource_group.aks_rg will be created
  + resource "azurerm_resource_group" "aks_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "akscluster-northeurope-aks-rg"
      + tags     = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }
    }

  # azurerm_role_assignment.aks-acr_assign will be created
  + resource "azurerm_role_assignment" "aks-acr_assign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = false
    }

  # azurerm_role_assignment.aks_grafanaviewer will be created
  + resource "azurerm_role_assignment" "aks_grafanaviewer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "44355144-d87d-4e26-818c-0fd9babacf9a"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/providers/Microsoft.Authorization/roleDefinitions/60921a7e-fef1-4a43-9b16-a26c52ad4769"
      + role_definition_name             = (known after apply)
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.aks_readerrole will be created
  + resource "azurerm_role_assignment" "aks_readerrole" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/providers/Microsoft.Authorization/roleDefinitions/b0d8363b-8ddd-447d-831f-62ca05bff136"
      + role_definition_name             = (known after apply)
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_subnet.aks_subnet will be created
  + resource "azurerm_subnet" "aks_subnet" {
      + address_prefixes                              = [
          + "10.224.0.0/16",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "akscluster-northeurope-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "akscluster-northeurope-network-rg"
      + virtual_network_name                          = "akscluster-northeurope-vnet"
    }

  # azurerm_virtual_network.aks_vnet will be created
  + resource "azurerm_virtual_network" "aks_vnet" {
      + address_space       = [
          + "10.224.0.0/12",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "akscluster-northeurope-vnet"
      + resource_group_name = "akscluster-northeurope-network-rg"
      + subnet              = (known after apply)
    }

Plan: 24 to add, 0 to change, 0 to destroy.
```
</details>